
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * module.postgresql_flexible.azurerm_log_analytics_workspace.pgsql_log_analytics_workspace[0]
  * module.postgresql_flexible.azurerm_monitor_diagnostic_setting.pgsql_diag[0]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;log_lock_waits&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;pg_qs.query_capture_mode&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;pgms_wait_sampling.query_capture_mode&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;track_io_timing&#34;]
* Update
  * azurerm_key_vault_secret.POSTGRES-CONNECTION-STRING
  * azurerm_key_vault_secret.POSTGRES_HOST
* Replace
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;darts&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-CONNECTION-STRING will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-CONNECTION-STRING" {
        id                      = "https://darts-prod.vault.azure.net/secrets/api-POSTGRES-CONNECTION-STRING/57066bbe062f4d098340ca6aacce251b"
        name                    = "api-POSTGRES-CONNECTION-STRING"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://darts-prod.vault.azure.net/secrets/api-POSTGRES-HOST/40316ef6c6b54deda6a18f00d54db771"
        name                    = "api-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_log_analytics_workspace.pgsql_log_analytics_workspace[0] will be created
  + resource "azurerm_log_analytics_workspace" "pgsql_log_analytics_workspace" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "darts-api-prod-workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "darts-prod-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.postgresql_flexible.azurerm_monitor_diagnostic_setting.pgsql_diag[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "pgsql_diag" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "darts-api-prod-to-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "PostgreSQLFlexDatabaseXacts"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLFlexQueryStoreRuntime"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLFlexQueryStoreWaitStats"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLFlexSessions"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLFlexTableStats"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "PostgreSQLLogs"
            # (1 unchanged attribute hidden)
        }
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "darts-api-prod.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod" -> (known after apply)
        name                          = "darts-api-prod"
      ~ storage_tier                  = "P20" -> (known after apply)
        tags                          = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-api.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
      ~ version                       = "15" -> "16" # forces replacement
      - zone                          = "2" -> null
        # (14 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["log_lock_waits"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "log_lock_waits"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["pg_qs.query_capture_mode"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "pg_qs.query_capture_mode"
      + server_id = (known after apply)
      + value     = "ALL"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["pgms_wait_sampling.query_capture_mode"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "pgms_wait_sampling.query_capture_mode"
      + server_id = (known after apply)
      + value     = "ALL"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["track_io_timing"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "track_io_timing"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["darts"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod/databases/darts" -> (known after apply)
        name      = "darts"
      ~ server_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/darts-api-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 9 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2185,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->